"""
num = 123456789
total = 0
while num != 0:
    last_digit = num % 10                      # Говно 2
    if last_digit > 4:
        total += 1

    num = num // 10

print(total)
"""

"""

num = 586
while num > 0:
    last_digit = num % 10
    print(last_digit, sep="*", end="#")        # Говно 1
    num //= 10
    print()
"""

"""
Дано натуральное число. Напишите программу, которая выводит его цифры в столбик в обратном порядке.

Формат входных данных
На вход программе подаётся натуральное число.                                                                                       # Задача 1

Формат выходных данных
Программа должна вывести цифры введённого числа в столбик в обратном порядке.

num = int(input())
while num > 0:
    last_digit = num % 10
    print(last_digit)
    num //= 10




"""

"""
Дано натуральное число. Напишите программу, которая меняет порядок цифр числа на обратный.

Формат входных данных                                                                                                               # Задача 2

На вход программе подаётся натуральное число.

Формат выходных данных
Программа должна вывести число, записанное в обратном порядке.

num = int(input())
while num > 0:
    last_digit = num % 10
    print(last_digit, end='')
    num //= 10

"""


"""
Дано натуральное число 
Напишите программу, которая определяет его максимальную и минимальную цифры и выводит текст в следующем формате:

Максимальная цифра равна <максимальная цифра>
Минимальная цифра равна <минимальная цифра>

                  
Формат входных данных
На вход программе подаётся натуральное число 


Формат выходных данных
Программа должна вывести текст в соответствии с условием задачи.

n = int(input())
a = str(n)
print('Максимальная цифра равна', max(a))
print('Минимальная цифра равна', min(a))



"""

"""
Дано натуральное число. Напишите программу, которая меняет порядок цифр числа на обратный.

Формат входных данных                                                                                                               # Задача 4

На вход программе подаётся натуральное число.

Формат выходных данных
Программа должна вывести число, записанное в обратном порядке.

num = int(input())
while num > 0:
    last_digit = num % 10
    print(last_digit, end='')
    num //= 10

"""

"""
Дано натуральное число. Напишите программу, которая выводит его цифры в столбик в обратном порядке.

Формат входных данных
На вход программе подаётся натуральное число.                                                                                       # Задача 1

Формат выходных данных
Программа должна вывести цифры введённого числа в столбик в обратном порядке.

num = int(input())
while num > 0:
    last_digit = num % 10
    print(last_digit)
    num //= 10




"""

"""
Дано натуральное число. Напишите программу, которая меняет порядок цифр числа на обратный.

Формат входных данных                                                                                                               # Задача 2

На вход программе подаётся натуральное число.

Формат выходных данных
Программа должна вывести число, записанное в обратном порядке.

num = int(input())
while num > 0:
    last_digit = num % 10
    print(last_digit, end='')
    num //= 10

"""

"""
Дано натуральное число. Напишите программу, которая выводит его цифры в столбик в обратном порядке.

Формат входных данных
На вход программе подаётся натуральное число.                                                                                       # Задача 1

Формат выходных данных
Программа должна вывести цифры введённого числа в столбик в обратном порядке.

num = int(input())
while num > 0:
    last_digit = num % 10
    print(last_digit)
    num //= 10




"""

"""
Дано натуральное число. Напишите программу, которая меняет порядок цифр числа на обратный.

Формат входных данных                                                                                                               # Задача 2

На вход программе подаётся натуральное число.

Формат выходных данных
Программа должна вывести число, записанное в обратном порядке.

num = int(input())
while num > 0:
    last_digit = num % 10
    print(last_digit, end='')
    num //= 10

"""
